In [1]:
import numpy as np
import random as rand
import pandas as pd
from datetime import datetime
import pandas as pd
from matplotlib import pyplot as plt 
path = '/Users/k/Desktop/Python/GroceriesDataset/'


# dataset = pd.read_csv(path+'basket.csv')

groceries = pd.read_csv('/Users/kiang/Desktop/Python_Datasets/Groceries data.csv')
groceries.head()

In [2]:
groceries.head()

   Member_number        Date   itemDescription  year  month  day  day_of_week
0           1808  2015-07-21    tropical fruit  2015      7   21            1
1           2552  2015-05-01        whole milk  2015      5    1            4
2           2300  2015-09-19         pip fruit  2015      9   19            5
3           1187  2015-12-12  other vegetables  2015     12   12            5
4           3037  2015-01-02        whole milk  2015      1    2            4

In [3]:
groceries.info()
#dataset.head()
type(groceries['Date'])

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38765 entries, 0 to 38764
Data columns (total 7 columns):
Member_number      38765 non-null int64
Date               38765 non-null object
itemDescription    38765 non-null object
year               38765 non-null int64
month              38765 non-null int64
day                38765 non-null int64
day_of_week        38765 non-null int64
dtypes: int64(5), object(2)
memory usage: 2.1+ MB

pandas.core.series.Series

In [4]:
#groceries.loc[: , 'itemDescription' : 'day_of_week']
#groceries.groupby(by='day_of_week')['Member_number']

In [5]:
# Dataframes and Pandas
# In standard Python, dictionaries are formated with key value pairs, that resemble actualy pandadataframes.
dictsample = { 'Name' : ["Person1", 'Person2', 'Person3'],
                'ID' :  ["Weekiang", 'Joanne', "Enrico"],
                'Alias': ['Eagle', 'Hawk', 'Monkey']
                }
#dictsample['Name'][1]
#getting information from these data types ._Celsius.py
#Series are basically rows of a single column in a dataframe. You access it by using dataset['Colname']

converted = pd.DataFrame(dictsample)
print(converted) # tada! Your dataframe is formed.

      Name        ID   Alias
0  Person1  Weekiang   Eagle
1  Person2    Joanne    Hawk
2  Person3    Enrico  Monkey

In [6]:
converted['Name'] 
# Print out name as a series.
# you can see that it is different from the format of the above dictionary of lists. Check the type(converted['Name']).
# Dataframe is a container of  multiple series objects (Which are one dimensional arrays.)

0    Person1
1    Person2
2    Person3
Name: Name, dtype: object

In [7]:
converted.Name # Alternative method to return a series of the column.

0    Person1
1    Person2
2    Person3
Name: Name, dtype: object

In [8]:
groceries.columns[3:8]

Index(['year', 'month', 'day', 'day_of_week'], dtype='object')

In [9]:
groceries['month'].value_counts()

8     3498
5     3335
1     3333
6     3316
3     3283
11    3273
7     3268
10    3218
4     3172
12    3074
2     3032
9     2963
Name: month, dtype: int64

# LESSON 2 PANDAS : Using Indexes

To set a specific column as an index, then you can try using df.set_index('colname')

In [10]:
converted = converted.set_index('Name') # This will set the name column into a data

In [11]:
converted.head()

               ID   Alias
Name
Person1  Weekiang   Eagle
Person2    Joanne    Hawk
Person3    Enrico  Monkey

Alternatively, you can do it , while reading in the data into using read_csv( , index_col = 'colname')

# LESSON 3 PANDAS : Filtering Data Using Conditionals

## Use head() and info() to see what you need from the data
## shape() to get dimensions
## value_counts() to get a count of rows by different catergories 
## .loc[] - for using indexes for accessing rows, for using colnames for accessing columns 
## iloc[] - for using indexes for accessing rows, column positions for accessing columns

In [12]:
groceries.head()

   Member_number        Date   itemDescription  year  month  day  day_of_week
0           1808  2015-07-21    tropical fruit  2015      7   21            1
1           2552  2015-05-01        whole milk  2015      5    1            4
2           2300  2015-09-19         pip fruit  2015      9   19            5
3           1187  2015-12-12  other vegetables  2015     12   12            5
4           3037  2015-01-02        whole milk  2015      1    2            4

In [13]:
groceries['year'].value_counts() # Theres only data for 2014, and 2015.

2015    20488
2014    18277
Name: year, dtype: int64

In [14]:
# To use conditionals use "==" to tell python you're passing in conditionals 

year_2014 = (groceries['year'] == 2014) # & (groceries['month'] == 7) 
print(year_2014) # Gives you a series of booleans of True and Falses To pass into each row of the data frome.

0        False
1        False
2        False
3        False
4        False
         ...
38760     True
38761     True
38762     True
38763     True
38764     True
Name: year, Length: 38765, dtype: bool

In [15]:
data_of_2014 = groceries.loc[year_2014] # Fit it directly into your data set loc statement to get you back what you need.
data_of_2014['year'].value_counts()

2014    18277
Name: year, dtype: int64

## Using .isin() : Equivalent to an IN Operator in SQL , gets you back matches of multiple values.groceries
## Using & , | for AND and OR respectively

In [16]:
filterbyquart3 = groceries['month'].isin([7,8,9])

In [17]:
groceries.loc[filterbyquart3]

,Member_number,Date,itemDescription,year,month,day,day_of_week
0,1808,2015-07-21,tropical fruit,2015,7,21,1
2,2300,2015-09-19,pip fruit,2015,9,19,5
6,4501,2015-08-05,other vegetables,2015,8,5,2
12,1997,2015-07-21,frankfurter,2015,7,21,1
14,4736,2015-07-21,butter,2015,7,21,1
...,...,...,...,...,...,...,...
38745,3082,2014-07-22,whole milk,2014,7,22,1
38747,2639,2014-08-06,fruit/vegetable juice,2014,8,6,2
38755,4586,2014-09-26,bottled water,2014,9,26,4
38757,4376,2014-07-12,rolls/buns,2014,7,12,5
38760,4471,2014-08-10,sliced cheese,2014,8,10,6

## You can use string methods to extract substrings as conditionals as well, using str.contains() method.

### For example, to extract only items that are under fruits, as an itemDescription , use 
### df.str.contains('fruits')!

In [18]:
fruitcatergory = groceries['itemDescription'].str.contains('fruit')
fruitsdata = groceries.loc[fruitcatergory]

# *** put in str.contains('colname', na = False) to prevent getting an error, because of NaN values in the column pass into the method.

In [19]:
fruitsdata

,Member_number,Date,itemDescription,year,month,day,day_of_week
0,1808,2015-07-21,tropical fruit,2015,7,21,1
2,2300,2015-09-19,pip fruit,2015,9,19,5
9,4119,2015-12-02,tropical fruit,2015,12,2,2
10,1340,2015-02-24,citrus fruit,2015,2,24,1
15,1959,2015-03-30,fruit/vegetable juice,2015,3,30,0
...,...,...,...,...,...,...,...
38659,4931,2014-08-28,fruit/vegetable juice,2014,8,28,3
38713,4117,2014-03-08,fruit/vegetable juice,2014,3,8,5
38747,2639,2014-08-06,fruit/vegetable juice,2014,8,6,2
38756,1987,2014-10-29,fruit/vegetable juice,2014,10,29,2
38763,1510,2014-03-12,fruit/vegetable juice,2014,3,12,2

## Lesson 4 : Updating Rows and Columns 
### List Comprehensions can be used to apply a method or function across the columnnames in question. It is a pythonic way of getting the data to go through a change. 


### To change column names to uppercases , you can:

In [20]:
samplerename = [colnames.upper() for colnames in groceries.columns ] # Upper() a method we pass into a list comprehension for us to do this renaming 
print(samplerename)

['MEMBER_NUMBER', 'DATE', 'ITEMDESCRIPTION', 'YEAR', 'MONTH', 'DAY', 'DAY_OF_WEEK']

### Alternatively:

In [21]:
samplerename2 = []
for colnames in groceries.columns:
    samplerename2.append(colnames.upper())
print(samplerename2)

['MEMBER_NUMBER', 'DATE', 'ITEMDESCRIPTION', 'YEAR', 'MONTH', 'DAY', 'DAY_OF_WEEK']

## to remove the regex '_' from your colnames, or vice versa, use the str.replace('itemtoreplace', 'itemtoimputewith') method.

In [23]:
samplecopy = groceries.columns.str.replace('_', '')
print(samplecopy)

Index(['Membernumber', 'Date', 'itemDescription', 'year', 'month', 'day',
       'dayofweek'],
      dtype='object')

## Best Method to usually replace names with what you want:

### use df.rename(columns = {'Old Name' : 'New Name'}, inplace = True)

###  We usually pass in a dictionary {} to change the column names into the values we want it to change into. 

### Inplace = False would be default, meaning it would jus show us the output of our change, but does not change the actual df. To actually change it, we need to set inplace = True.

In [24]:
rename_dictionary = {'Member_number' : 'Member_Number', 'itemDescription': 'Item_Desc', 'year' : 'Year', 'month' : 'Month', 'day_of_week' : 'Day_Of_Week'}

groceries.rename(columns = rename_dictionary, inplace =True) # IMPT inplace = True
groceries

,Member_Number,Date,Item_Desc,Year,Month,day,Day_Of_Week
0,1808,2015-07-21,tropical fruit,2015,7,21,1
1,2552,2015-05-01,whole milk,2015,5,1,4
2,2300,2015-09-19,pip fruit,2015,9,19,5
3,1187,2015-12-12,other vegetables,2015,12,12,5
4,3037,2015-01-02,whole milk,2015,1,2,4
...,...,...,...,...,...,...,...
38760,4471,2014-08-10,sliced cheese,2014,8,10,6
38761,2022,2014-02-23,candy,2014,2,23,6
38762,1097,2014-04-16,cake bar,2014,4,16,2
38763,1510,2014-03-12,fruit/vegetable juice,2014,3,12,2
38764,1521,2014-12-26,cat food,2014,12,26,4

### 1.) Apply : Applies a function on every item in a series. Can work on both Dataframes and Objects 

        1.1 On SERIES: df*[*'colname'*]*.apply(function()) , it applies the function downwards, on every item in the series .

####  df.apply(function()) , it applies the function on every series (ACROSS) in the *DATAFRAME*. 
        1.2 On DATAFRAMES: df.apply(function()) , it applies the function on every series in the dataframe. Default being axis = 'Rows' 
        axis = 'columns' , applies the function across the row in the dataframe, needa pass functions that makes sense.

### 2.) Map : Applied on a series : does not work on the dataframe. I.e df*[*'Colname'*]*.map({'OldValue':'NewValue', 'OldValue2':'NewValue2'})
        If there are OldValues not accounted for in the map method, map will return an error NaN as a value for that field. Use replace() for that instead.

### 3.) Replace

### 4.) ApplyMap : Applies only on the dataframe.

In [25]:
#This is an old way. Imputing via loops, looking up values with dictionaries.

monthnames = { 1 :"January", 
               2 :"February",
               3 :"March",
               4 :"April", 
               5 :"May", 
               6 :"June", 
               7 :"July", 
               8 :"August", 
               9 :"September", 
               10 :"October", 
               11 :"November",
               12 :"December"
                   }

#monthtest = 1 
#datetime.strptime(monthtest, "%m")

for j in range(len(list(groceries['Month']))):
    hold = groceries.Month[j]
    for key, value in monthnames.items():
        if hold == key:
            groceries.Month[j] = value # 
groceries

ipykernel_launcher:24: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
C:\Users\k\AppData\Roaming\Python\Python37\site-packages\pandas\core\indexing.py:205: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

,Member_Number,Date,Item_Desc,Year,Month,day,Day_Of_Week
0,1808,2015-07-21,tropical fruit,2015,July,21,1
1,2552,2015-05-01,whole milk,2015,May,1,4
2,2300,2015-09-19,pip fruit,2015,September,19,5
3,1187,2015-12-12,other vegetables,2015,December,12,5
4,3037,2015-01-02,whole milk,2015,January,2,4
...,...,...,...,...,...,...,...
38760,4471,2014-08-10,sliced cheese,2014,August,10,6
38761,2022,2014-02-23,candy,2014,February,23,6
38762,1097,2014-04-16,cake bar,2014,April,16,2
38763,1510,2014-03-12,fruit/vegetable juice,2014,March,12,2
38764,1521,2014-12-26,cat food,2014,December,26,4

In [26]:
#Alterative, better method using map() on a series! :)
monthnames = { 1 :"January", 
               2 :"February",
               3 :"March",
               4 :"April", 
               5 :"May", 
               6 :"June", 
               7 :"July", 
               8 :"August", 
               9 :"September", 
               10 :"October", 
               11 :"November",
               12 :"December"
                   }
# remember: you are always passing in a dictionary of key value pairs to change the items you want in a series.
groceries['month'] = groceries['month'].map(monthnames)
groceries

KeyError: 'month'

In [1]:
x  = groceries.itemDescription.value_counts().nlargest(10).index
y = groceries.itemDescription.value_counts().nlargest(10).values



fig , ax = plt.subplots()
width = 0.25
ax.bar(x, y, width = width, edgecolor = 'black')
ax.set_title('Top 15 Products that are most frequently purchased')
ax.set_xlabel('Items')
ax.set_ylabel('Frequency')

NameError: name 'groceries' is not defined

### LESSON 6 GROUPBY FUNCTIONS AGGREGATING DATA

In [47]:
groceries.groupby('Month')['Item_Desc'].value_counts() # Group by a month, then group by a specific month you want to see

KeyError: 'Month'

## The above groupby query looks like this.

    SELECT month, count(Item_Desc)
    From groceries
    GROUP BY month
    quit;

In [ ]:
#groceries.groupby('Month')['day'].value_counts().loc['April']
groceries.groupby('Month')['Item_Desc'].apply(lambda x :x.str.contains('fruit').sum())

#groceries['Month'].value_counts()

In [1]:
aggregated_percentage = pd.concat([groceries.groupby('Month')['Item_Desc'].apply(lambda x :x.str.contains('fruit').sum()), groceries['Month'].value_counts() ], axis= 'columns', sort = False)

aggregated_percentage.rename(columns = {'Item_Desc' : 'Number of Sale of Fruits Per Month' , 'Month' : 'Total Sales Per Month'} , inplace = True) # rmb to put inplace = true

NameError: name 'pd' is not defined

In [ ]:
PercentageofFruitPurchases = aggregated_percentage['Number of Sale of Fruits Per Month'] / aggregated_percentage['Total Sales Per Month'] * 100

In [ ]:
PercentageofFruitPurchases

## LESSON 5 : ADDING NEW COLUMNS AND REMOVING COLUMNS: Rows and Removing Columns

### ADDING NUMERIC COLUMNS 
### When creating new columns , you usually use df*[*'column'*]* , instead of df.column. The former tells Python to create a column. The  latter tells Python to assign to existing columns.

In [ ]:
#groceries

In [ ]:

# Adding a column called columnadded, with 2 numeric columns.
groceries['columnadded'] = groceries['day'] + groceries['Day_Of_Week']
groceries.info()

### ADDING CHARACTER COLUMNS 
### expand = True in the str.split function helps you split up a text column into multiple parts, for you to create separate fields
### Use pd.concat() to bind different dataframes/series together. 
### axis = 'columns' : cbind.
### axis = 'rows' : rbind

In [ ]:
# Splits the string by /, and create different outputs by using the expand function.
varstore = groceries['Item_Desc'].str.split('/', expand = True)

# rename , into item description 1 and 2.
varstore.rename(columns= {0 : 'ItemDescription1' , 1 :'ItemDescription2'}, inplace = True)

#add new columns into groceries dataframe and drop old column
pd.concat([groceries, varstore], axis = 'columns' )

### Adding Rows : Use the Append Method to add rows.
 
### df.append({'ColnameyouWanttoAddaValueInto' : Value, *add more columns and values pairs...* }, ignore_index = True) # to bypass index positioning

In [ ]:
# Create a new row, with values you inserted, as a dataframe row, for you to append. it will naturally come at the bottom of the dataframe. 
df2 = { 'Day_of_Week' : [7] , 
        'day' : [7] ,
        'Month'  : ['July'],
        'Item_Desc' :  ['Cherry'],   
        'Year'  : ['2021'] } 

df2 = pd.DataFrame(df2)

groceries.append(df2, ignore_index= True ) #sort = False 
# Also there is no inplace = True argument. if you want to cast the appending in stone, reassign the groceries variable with this same statement! 

#Not going to reassign, but the code is commented out below.
#groceries =groceries.append(df2, ignore_index= True )

In [ ]:
groceries.describe()

### Deleting ROWS 

###based on similarly use the drop() method, with items within it.

### index = Position you want to remove.

### i.e. groceries.drop(index = 7) # drop 8th item in the dataframe.

# LESSON 7 : DATE FORMATS AND READING THEM PROPERLY.

## Firstly, within a csv file, you can read a file in with their datetime/date formats by using an anonymous function , then parse columns into the format u want.

## The code below uses variable d_parser as a function , telling Python to read the groceries dataset in this format.
d_parser = lambda x: datetime.strptime(x, "%Y-%m-%d")


groceries = pd.read_csv(path+'Groceries data.csv', parse_dates =[['Date']], date_parser = d_parser)

### Note: that datetime.strptime() runs on value by value, not on a series, or a dataframe.

### To convert a column/series to datetime, use pd.to_datetime() method instead.

## Alternatively, you can change the formats inside, after u looked at the dataset.

In [71]:
# Calling it like this, it gets called as a string
groceries['Date'][0]

'2015-07-21'

In [83]:
# use the to_datetime() method on the item, to parse it into dates.

groceries['Date'] = pd.to_datetime(groceries['Date'], format ='%Y-%m-%d')

# this step uses the pd.to_datetime() method, it tells Python you want to read it as a date, with this FORMAT.

## Now you can use the datetime class, (dt) to actually perform datetime operations on your date fields!

### Some examples : df[['colname']].dt.day_name()

In [84]:
groceries['Date'].dt.day_name()

0          Tuesday
1           Friday
2         Saturday
3         Saturday
4           Friday
           ...
38760       Sunday
38761       Sunday
38762    Wednesday
38763    Wednesday
38764       Friday
Name: Date, Length: 38765, dtype: object

# Create filters using your dates.

## After creating your dates , you will be able to filter records accordingly using these dates.

In [95]:
# You can filter using years like this...python recognises the year automatically , but it will only filter 2015-01-01 specifically.
datefilter = (groceries['Date'] >= '2015')

# or you can set a more specific range of date intervals, but you will have to use pd.to_datetime(' ' ) to do it.
filterrange = (groceries['Date'] >= pd.to_datetime('2015-03-01')) & (groceries['Date'] <= pd.to_datetime('2015-04-03')) 


groceries.loc[filterrange, :]

,Member_Number,Date,Item_Desc,Year,Month,day,Day_Of_Week,columnadded
8,2762,2015-03-20,whole milk,2015,March,20,4,24
13,4546,2015-03-09,chicken,2015,March,9,0,9
15,1959,2015-03-30,fruit/vegetable juice,2015,March,30,0,30
16,1974,2015-03-05,packaged fruit/vegetables,2015,March,5,3,8
18,1513,2015-03-08,specialty bar,2015,March,8,6,14
...,...,...,...,...,...,...,...,...
37048,4951,2015-03-13,seasonal products,2015,March,13,4,17
37078,2584,2015-03-31,shopping bags,2015,March,31,1,32
37085,3316,2015-03-01,abrasive cleaner,2015,March,1,6,7
37087,4889,2015-03-02,bottled water,2015,March,2,0,2
37113,4847,2015-03-02,margarine,2015,March,2,0,2

## Pandas DataFrame Merge Function:
## Merge is Pandas way of combining multiple datasets . 
  
df.merge(df2 , /Options below/)

#DataFrame.merge(right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)

## how = '' : lets you choose what type of join you want.
### left, right, inner , outer.
## on = '' : lets you choose what type of key field in the sql join u wish to join on.

In [31]:
import pandas as pd
import numpy as np

student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})


print(student_data1)
print(student_data2)
# This gives you an left join, on the data student_id field. 
# It keeps both marks field in both tables, labelling them with suffixes indicator in the suffix option 
student_data1.merge(student_data2, how = 'left', on = 'student_id', suffixes = ('_left', '_right') )

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

  student_id         name_left  marks_left        name_right  marks_right
0         S1  Danniella Fenton         200               NaN          NaN
1         S2      Ryder Storey         210               NaN          NaN
2         S3      Bryce Jensen         190               NaN          NaN
3         S4         Ed Bernal         222  Scarlette Fisher        201.0
4         S5       Kwame Morin         199  Carla Williamson        200.0

In [33]:
# Right Join 
student_data1.merge(student_data2, how = 'right', on = 'student_id' )

  student_id       name_x  marks_x            name_y  marks_y
0         S4    Ed Bernal    222.0  Scarlette Fisher      201
1         S5  Kwame Morin    199.0  Carla Williamson      200
2         S6          NaN      NaN       Dante Morse      198
3         S7          NaN      NaN    Kaiser William      219
4         S8          NaN      NaN   Madeeha Preston      201

In [35]:
# Inner Join 
student_data1.merge(student_data2, how = 'right', on = 'student_id' )

  student_id       name_x  marks_x            name_y  marks_y
0         S4    Ed Bernal    222.0  Scarlette Fisher      201
1         S5  Kwame Morin    199.0  Carla Williamson      200
2         S6          NaN      NaN       Dante Morse      198
3         S7          NaN      NaN    Kaiser William      219
4         S8          NaN      NaN   Madeeha Preston      201

### The FULL OUTER JOIN keyword returns all matching records from both tables whether the other table matches or not. So, if there are rows in "Customers" that do not have matches in "Orders", or if there are rows in "Orders" that do not have matches in "Customers", those rows will be listed as well.

SELECT student1_data.name, student2_data.name, student1_data.marks as marks.x, student2_data.marks as marks_y

FROM student1_data

FULL OUTER JOIN Orders 

ON student1_data.student_id=student2_data.student_id

ORDER BY Customers.CustomerName;

In [34]:
# Outer Join : Operate similar to a full join. 
student_data1.merge(student_data2, how = 'outer', on = 'student_id' )

  student_id            name_x  marks_x            name_y  marks_y
0         S1  Danniella Fenton    200.0               NaN      NaN
1         S2      Ryder Storey    210.0               NaN      NaN
2         S3      Bryce Jensen    190.0               NaN      NaN
3         S4         Ed Bernal    222.0  Scarlette Fisher    201.0
4         S5       Kwame Morin    199.0  Carla Williamson    200.0
5         S6               NaN      NaN       Dante Morse    198.0
6         S7               NaN      NaN    Kaiser William    219.0
7         S8               NaN      NaN   Madeeha Preston    201.0

In [53]:
# Overlapping columns 
student_data1.merge(student_data2, how = 'left', on = 'student_id' ).loc[: ,['student_id','marks_x','marks_y']].rename( columns = { 'name_x' : 'student1_name', 'name_y' : 'student2_name', 
    'marks_x': 'student1_marks', 'marks_y': 'student2_marks'})

  student_id  student1_marks  student2_marks
0         S1             200             NaN
1         S2             210             NaN
2         S3             190             NaN
3         S4             222           201.0
4         S5             199           200.0